app/views/users/show.html.erb


  <% @posts = Post.where(user_id: @user.id) %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]